{
  "err_invalid_username_password": "Incorrect username or password. Please try again.",
  "err_invalid_credentials": "Invalid credentials. Please check your username and password.",
  "err_authentication_failed": "Authentication failed. Please verify your login information.",
  "err_account_locked": "Account locked. Too many failed login attempts. Please reset your password or contact support.",
  "err_incorrect_password": "Password is incorrect. Please double-check and try again.",
  "err_account_not_found": "Account not found. Please ensure you have entered the correct username.",
  "err_invalid_input": "Invalid input. Please review the entered data and try again.",
  "err_missing_fields": "Missing required fields. Please fill in all the mandatory information.",
  "err_invalid_email_format": "Invalid email format. Please enter a valid email address.",
  "err_weak_password": "Password strength is weak. Please use a stronger password.",
  "err_username_exists": "Username already exists. Please choose a different username.",
  "err_file_upload_failed": "File upload failed. Please make sure the file format is supported.",
  "err_access_denied": "Access denied. You do not have sufficient permissions to perform this action.",
  "err_session_expired": "Session expired. Please log in again to continue.",
  "err_connection_timeout": "Connection timed out. Please check your internet connection and try again.",
  "err_general_error": "An error occurred. Please try again later.",
  "err_server_unavailable": "Server unavailable. Please try again after some time.",
  "err_invalid_request": "Invalid request. Please provide valid data.",
  "err_action_not_allowed": "Action not allowed. Please contact support for further assistance.",
  "err_data_validation_failed": "Data validation failed. Please review your input for errors.",
  "err_connection_lost": "Connection lost. Please check your internet connection and try again.",
  "err_expired_session": "Expired session. Please log in again to continue.",
  "err_unexpected_error": "Unexpected error. Please refresh the page and try again.",
  "err_invalid_date_format": "Invalid date format. Please enter a valid date.",
  "err_email_delivery_failed": "Email delivery failed. Please ensure the recipient's email address is valid."
}
