{
  "err_invalid_username_password": "Неправильное имя пользователя или пароль. Пожалуйста, попробуйте снова.",
  "err_invalid_credentials": "Недопустимые учетные данные. Проверьте имя пользователя и пароль.",
  "err_authentication_failed": "Не получилось войти. Пожалуйста, проверьте ваши данные для входа.",
  "err_account_locked": "Аккаунт заблокирован. Слишком много неудачных попыток входа. Пожалуйста, сбросьте пароль или обратитесь в службу поддержки.",
  "err_incorrect_password": "Неправильный пароль. Пожалуйста, проверьте и попробуйте снова.",
  "err_account_not_found": "Аккаунт не найден. Пожалуйста, убедитесь, что вы ввели правильное имя пользователя.",
  "err_invalid_input": "Недопустимый ввод. Пожалуйста, проверьте введенные данные и попробуйте снова.",
  "err_missing_fields": "Пропущены обязательные поля. Пожалуйста, заполните все обязательные поля.",
  "err_invalid_email_format": "Недопустимый формат электронной почты. Пожалуйста, введите действительный адрес электронной почты.",
  "err_weak_password": "Ненадежный пароль. Пожалуйста, используйте более надежный пароль.",
  "err_username_exists": "Имя пользователя уже существует. Пожалуйста, выберите другое имя пользователя.",
  "err_file_upload_failed": "Ошибка загрузки файла. Пожалуйста, убедитесь, что формат файла поддерживается.",
  "err_access_denied": "Доступ запрещен. У вас недостаточно прав для выполнения данного действия.",
  "err_session_expired": "Сессия истекла. Пожалуйста, выполните вход снова, чтобы продолжить.",
  "err_connection_timeout": "Потеряно соединение. Пожалуйста, проверьте ваше интернет-соединение и попробуйте снова.",
  "err_general_error": "Произошла ошибка. Пожалуйста, попробуйте снова позже.",
  "err_server_unavailable": "Сервер недоступен. Пожалуйста, попробуйте снова через некоторое время.",
  "err_invalid_request": "Недопустимый запрос. Пожалуйста, введите действительные данные.",
  "err_action_not_allowed": "Действие запрещено. Пожалуйста, свяжитесь с поддержкой для получения дальнейшей помощи.",
  "err_data_validation_failed": "Проверка данных не пройдена. Пожалуйста, проверьте введенные данные на ошибки.",
  "err_connection_lost": "Потеряно соединение. Пожалуйста, проверьте ваше интернет-соединение и попробуйте снова.",
  "err_expired_session": "Истекла сессия. Пожалуйста, выполните вход снова, чтобы продолжить.",
  "err_unexpected_error": "Неожиданная ошибка. Пожалуйста, обновите страницу и попробуйте снова.",
  "err_invalid_date_format": "Недопустимый формат даты. Пожалуйста, введите действительную дату.",
  "err_email_delivery_failed": "Ошибка доставки электронной почты. Пожалуйста, убедитесь, что адрес получателя является действительным."
}
